<a href="https://colab.research.google.com/github/SainiManisha/dbms-tutorial/blob/master/MySQL_Constraints_Joins_Key.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/ce/1d/378f92f45fb98d7e033f6a94b0600b8ae496e67ba411b992f536784a3d0d/mysql_connector_python-8.0.21-cp36-cp36m-manylinux1_x86_64.whl (15.8MB)
     |████████████████████████████████| 15.8MB 313kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (50.3.0)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.21

In [2]:
import mysql.connector
import pandas as pd

In [3]:
conn0 = mysql.connector.connect(
    host="34.93.147.110",
    user="root",
    password="123456789",
    port=3306
)

cur = conn0.cursor()

In [5]:
query = """
    CREATE DATABASE organisation1;
"""
cur.execute(query)

In [8]:
conn = mysql.connector.connect(
    host="34.93.147.110",
    user="root",
    password="123456789",
    port=3306,
    database='organisation1'
)

In [9]:
cur = conn.cursor()

In [10]:
query = """
    CREATE TABLE employee(
        id INT(10) PRIMARY KEY, 
        name TEXT NOT NULL,
        phone INT(10),
        email VARCHAR(50) NOT NULL UNIQUE
    )
"""
cur.execute(query)

In [11]:
query = """
    INSERT INTO employee (id, name, phone, email) VALUES
        (1, "Employee A", 983003372, "employee.a@organisation.org"),
        (2, "Employee B", 983003371, "employee.b@organisation.org"),
        (3, "Employee C", 983003373, "employee.c@organisation.org"),
        (4, "Employee D", 983003374, "employee.d@organisation.org"),
        (5, "Employee E", 983003375, "employee.e@organisation.org")
"""
cur.execute(query)

In [12]:
pd.read_sql("SELECT * FROM employee", conn)

   id        name      phone                        email
0   1  Employee A  983003372  employee.a@organisation.org
1   2  Employee B  983003371  employee.b@organisation.org
2   3  Employee C  983003373  employee.c@organisation.org
3   4  Employee D  983003374  employee.d@organisation.org
4   5  Employee E  983003375  employee.e@organisation.org

In [ ]:
query = """
    CREATE TABLE staff1(
        id INT(10) PRIMARY KEY, 
        department TEXT NOT NULL DEFAULT("administration"),
        emp_id INT(10),
        FOREIGN KEY (emp_id) REFERENCES employee(id)
    )
"""
cur.execute(query)

In [21]:
query = """
    CREATE TABLE faculty1(
        id INT(10) PRIMARY KEY, 
        department TEXT,
        designation TEXT,
        age INT(2) CHECK (age <= 60),
        emp_id INT(10),
        FOREIGN KEY (emp_id) REFERENCES employee(id)
    )
"""
cur.execute(query)

In [27]:
query = """
    INSERT INTO staff1 (id, department, emp_id) VALUES
        (911, "security", 1),
        (921, "accounts", 2)
"""
cur.execute(query)

query = """
    INSERT INTO staff1 (id, emp_id) VALUES
        (931, 3)
"""
cur.execute(query)

In [29]:
pd.read_sql("SELECT * FROM staff1", conn)

    id      department  emp_id
0   91        security       1
1   92        accounts       2
2  911        security       1
3  921        accounts       2
4  931  administration       3

In [31]:
query = """
    INSERT INTO faculty1 (id, department, designation, age, emp_id) VALUES
        (81, "CSE", "Assistant Professor", 67, 4),
        (82, "ME", "Associate Professor", 45, 5)
"""
cur.execute(query)

DatabaseError: ignored

In [32]:
query = """
    INSERT INTO faculty1 (id, department, designation, age, emp_id) VALUES
        (81, "CSE", "Assistant Professor", 30, 4),
        (82, "ME", "Associate Professor", 45, 5)
"""
cur.execute(query)

In [33]:
pd.read_sql("SELECT * FROM faculty1", conn)

   id department          designation  age  emp_id
0  81        CSE  Assistant Professor   30       4
1  82         ME  Associate Professor   45       5

In [34]:
query = """SELECT employee.id, employee.name, employee.email,
    faculty1.id, faculty1.department, faculty1.age
    FROM employee INNER JOIN faculty1
    ON faculty1.emp_id = employee.id"""
pd.read_sql(query, conn)

   id        name                        email  id department  age
0   4  Employee D  employee.d@organisation.org  81        CSE   30
1   5  Employee E  employee.e@organisation.org  82         ME   45

In [36]:
query = """
    DROP DATABASE organisation1;
"""
cur.execute(query)